app/controllers/students_controller.rb

INSERT INTO `students` (`name`, `bloodgroup`, `department`, `created_at`, `updated_at`) VALUES ('cxv', 'bv', 'bv', '2016-10-06 10:08:58', '2016-10-06 10:08:58')
---
	def create
		#this cod eis used for checking
		#render plain: params[:student].inspect

		#@student = Student.new(params[:student])
		@student =  Student.new(student_params)
		if @student.save

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
	def show
		@student = Student.find(params[:id])

SELECT `students`.* FROM `students`
---
	def index
		@students = Student.all

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
	def edit
  		@student = Student.find(params[:id])

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
UPDATE `students` SET `name` = 'cxvfghf', `updated_at` = '2016-10-06 10:56:29' WHERE `students`.`id` = 1
---
	def update
  		@student = Student.find(params[:id])

  		if @student.update(student_params)